scripts/artillery/test.yml
config:
  target: "https://test.mantra-seeds.com/"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Adding items to carts"
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: Add item to cart
    flow:
      - post:
          url: "/api/carts/"
          json:
            id: null
            user: null
            cartItems: 
              - product: "648a2eb430248cc08b9662e6"
                quantity: 1
                price: 100 # Assume a price here. Replace with actual one if necessary.